cool/tutorials/viscoelastic/viscoelasticFluidFoam/S-MDCPP/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

 echo "Running blockMesh application"
 runApplication blockMesh

 echo "Running viscoelasticFluidFoam solver"
 echo "S-MDCPP model:"
 runApplication $application

 echo "done!"
